# YOLOv8m backbone with attention blocks + optimized multi-scale neck for pest detection
# Usage:
# yolo detect train model=models/yolov8m_pest_attention.yaml data=data/pests.yaml imgsz=960 device=0

nc: 80
scales:
  m: [0.67, 0.75, 768]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, C2fAttn, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, C2fAttn, [512, True]]
  - [-1, 1, Conv, [768, 3, 2]]
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, SPPF, [768, 5]]

head:
  # top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2fAttn, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2fAttn, [256]]

  # bottom-up pathway (PAN + enhanced fusion)
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2fAttn, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2fAttn, [768]]

  - [[17, 20, 23], 1, Detect, [nc]]
